FormatSamples/structure_backup/Catalogs/ТелеграмОбработка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТелеграмОбработка</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмСтатусыИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчиститьКонтекст</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСборкиОтвета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбработки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмТипыОбработок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействияНадКонтекстомАвто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДействияНадКонтекстом</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Действие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграмДействияСКонтекстом</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ТелеграмПараметрыКонтекста</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FormatSamples/structure_backup/Catalogs/ТелеграмСервис.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ТелеграмСервис</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмСтатусыИспользования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелеграмБоты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВходящегоОбновления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТелеграмВидыВходящихОбновлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийТекстАвто</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаборыУсловийАвто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработкиАвто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящийТекст</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВходящиеДанные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСравнения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаборыУсловий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаборУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмНаборУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Обработка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмОбработка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаборУсловий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелеграмНаборУсловий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FormatSamples/structure_backup/Catalogs/ТелеграмНаборУсловий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
  <Catalog>
    <Properties>
      <Name>ТелеграмНаборУсловий</Name>
      <Hierarchical>true</Hierarchical>
      <HierarchyType>HierarchyFoldersAndItems</HierarchyType>
    </Properties>
    <ChildObjects>
      <Attribute>
        <Properties>
          <Name>КонтекстАвто</Name>
          <Type>
            <v8:Type>xs:decimal</v8:Type>
            <v8:NumberQualifiers>
              <v8:Digits>3</v8:Digits>
              <v8:FractionDigits>1</v8:FractionDigits>
            </v8:NumberQualifiers>
            <v8:Type>xs:boolean</v8:Type>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>УсловияАвто</Name>
          <Type>
            <v8:Type>xs:decimal</v8:Type>
            <v8:NumberQualifiers>
              <v8:Digits>2</v8:Digits>
              <v8:FractionDigits>1</v8:FractionDigits>
            </v8:NumberQualifiers>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>ПрограммнаяПроверка</Name>
          <Type>
            <v8:Type>xs:boolean</v8:Type>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>КодПроверки</Name>
          <Type>
            <v8:Type>xs:string</v8:Type>
            <v8:StringQualifiers>
              <v8:Length>0</v8:Length>
            </v8:StringQualifiers>
          </Type>
        </Properties>
      </Attribute>
      <Attribute>
        <Properties>
          <Name>Комментарий</Name>
          <Type>
            <v8:Type>xs:string</v8:Type>
            <v8:StringQualifiers>
              <v8:Length>0</v8:Length>
            </v8:StringQualifiers>
          </Type>
        </Properties>
      </Attribute>
      <TabularSection>
        <Properties>
          <Name>Контекст</Name>
        </Properties>
        <ChildObjects>
          <Attribute>
            <Properties>
              <Name>Параметр</Name>
              <Type>
                <v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметрыКонтекста</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>ВидСравнения</Name>
              <Type>
                <v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>Значение</Name>
              <Type>
                <v8:TypeSet>cfg:Characteristic.ТелеграмПараметрыКонтекста</v8:TypeSet>
              </Type>
            </Properties>
          </Attribute>
        </ChildObjects>
      </TabularSection>
      <TabularSection>
        <Properties>
          <Name>Условия</Name>
        </Properties>
        <ChildObjects>
          <Attribute>
            <Properties>
              <Name>Параметр</Name>
              <Type>
                <v8:Type>cfg:ChartOfCharacteristicTypesRef.ТелеграмПараметрыВходящегоСообщения</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>ВидСравнения</Name>
              <Type>
                <v8:Type>cfg:EnumRef.ТелеграмВидыСравнения</v8:Type>
              </Type>
            </Properties>
          </Attribute>
          <Attribute>
            <Properties>
              <Name>Значение</Name>
              <Type>
                <v8:TypeSet>cfg:Characteristic.ТелеграмПараметрыВходящегоСообщения</v8:TypeSet>
              </Type>
            </Properties>
          </Attribute>
        </ChildObjects>
      </TabularSection>
    </ChildObjects>
  </Catalog>
</MetaDataObject>

FormatSamples/structure_backup/Catalogs/ТелеграмОбработка/Ext/ManagerModule.bsl
// Получение обработок сервиса, подходящих по условиям
Функция ПолучитьОбработкиДляВыполнения(Сервис, НакопленныеДанные) Экспорт
	
	Ответ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Сервис", Сервис);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТелеграмСервисОбработки.Обработка КАК Обработка,
	|	ТелеграмСервисОбработки.НаборУсловий КАК НаборУсловий
	|ИЗ
	|	Справочник.ТелеграмСервис.Обработки КАК ТелеграмСервисОбработки
	|ГДЕ
	|	ТелеграмСервисОбработки.Ссылка = &Сервис
	|	И ТелеграмСервисОбработки.Обработка.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТелеграмСервисОбработки.НомерСтроки";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.НаборУсловий) Тогда
			УсловиеИстинно = Справочники.ТелеграмНаборУсловий.ПроверкаНабораУсловий(Выборка.НаборУсловий, НакопленныеДанные);
			Если УсловиеИстинно Тогда
				Ответ.Добавить(Выборка.Обработка);
			КонецЕсли;
		Иначе
			Ответ.Добавить(Выборка.Обработка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ответ;
	
Конецфункции


Функция ПолучитьОбработкиИсключения(НакопленныеДанные) Экспорт
	
	Ответ = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмОбработка.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ТелеграмОбработка КАК ТелеграмОбработка
	|ГДЕ
	|	ТелеграмОбработка.ТипОбработки = ЗНАЧЕНИЕ(Перечисление.ТелеграмТипыОбработок.Исключение)
	|	И ТелеграмОбработка.Статус = ЗНАЧЕНИЕ(Перечисление.ТелеграмСтатусыИспользования.Используется)";
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Ответ.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Возврат Ответ;
	
КонецФункции


Процедура ВыполнитьОбработку(Обработка, НакопленныеДанные) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Обработка", Обработка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТелеграмОбработка.ОчиститьКонтекст КАК ОчиститьКонтекст,
	|	ТелеграмОбработка.КодСборкиОтвета КАК КодСборкиОтвета
	|ИЗ
	|	Справочник.ТелеграмОбработка КАК ТелеграмОбработка
	|ГДЕ
	|	ТелеграмОбработка.Ссылка = &Обработка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТелеграмОбработкаДействияНадКонтекстом.Параметр КАК Параметр,
	|	ТелеграмОбработкаДействияНадКонтекстом.Действие КАК Действие,
	|	ТелеграмОбработкаДействияНадКонтекстом.Значение КАК Значение
	|ИЗ
	|	Справочник.ТелеграмОбработка.ДействияНадКонтекстом КАК ТелеграмОбработкаДействияНадКонтекстом
	|ГДЕ
	|	ТелеграмОбработкаДействияНадКонтекстом.Ссылка = &Обработка";
	
	Пакет = Запрос.ВыполнитьПакет();
	
	РезультатОбработка = Пакет[0];
	ВыборкаОбработка = РезультатОбработка.Выбрать();
	ВыборкаОбработка.Следующий();
	
	КодСборкиОтвета = ВыборкаОбработка.КодСборкиОтвета;
	
	ИдентификаторЧата = НакопленныеДанные.ИдентификаторЧата;
	
	Если ЗначениеЗаполнено(КодСборкиОтвета) Тогда
		НакопленныеДанные.Вставить("КонтекстСеанса", РегистрыСведений.ТелеграмКонтекстСеансов.ПолучитьКонтекстСеанса(ИдентификаторЧата));
		ТелеграмСервер.ВыполнитьКодСборкиОтвета(КодСборкиОтвета, НакопленныеДанные);
	КонецЕсли;
	
	Если ИдентификаторЧата <> Неопределено Тогда
		
		Если ВыборкаОбработка.ОчиститьКонтекст Тогда
			РегистрыСведений.ТелеграмКонтекстСеансов.ОчиститьКонтекстСеанса(ИдентификаторЧата);
		КонецЕсли;
	
		РезультатДействияНадКонтекстом = Пакет[1];
		ВыборкаДействияНадКонтекстом = РезультатДействияНадКонтекстом.Выбрать();
		Пока ВыборкаДействияНадКонтекстом.Следующий() Цикл
			РегистрыСведений.ТелеграмКонтекстСеансов.ИзменитьПараметрКонтекстаСеанса(
				ИдентификаторЧата,
				ВыборкаДействияНадКонтекстом.Параметр,
				ВыборкаДействияНадКонтекстом.Действие,
				ВыборкаДействияНадКонтекстом.Значение);
		КонецЦикла;
		      
	КонецЕсли;
	
КонецПроцедуры
